app/controllers/admin/restaurants_controller.rb

  def index
    @restaurants = Restaurant.page(params[:page]).per(10)
---
SELECT  "restaurants".* FROM "restaurants" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "restaurants"