app/views/restaurants/dashboard.html.erb

      <ul>
        <li>有 <%= @restaurant.comments.count %> 筆評論</li>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."restaurant_id" = ?  [["restaurant_id", 16]]