app/views/restaurants/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."restaurant_id" = ?  [["restaurant_id", 16]]
---
  <div class="row">
    <% @restaurant.comments.each do |comment| %>