app/controllers/comments_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "restaurant_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "test"], ["restaurant_id", 11], ["user_id", 1], ["created_at", "2017-12-30 13:37:24.377277"], ["updated_at", "2017-12-30 13:37:24.377277"]]
---
  def create
    @restaurant = Restaurant.find(params[:restaurant_id])
    @comment = @restaurant.comments.build(comment_params)
    @comment.user = current_user
    @comment.save!