app/controllers/followships_controller.rb

INSERT INTO "followships" ("user_id", "following_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["following_id", 2], ["created_at", "2018-01-03 14:05:20.056835"], ["updated_at", "2018-01-03 14:05:20.056835"]]
---
  def create
    @followship = current_user.followships.build(following_id: params[:following_id])

   if @followship.save

SELECT  "followships".* FROM "followships" WHERE "followships"."user_id" = ? AND "followships"."following_id" = ? ORDER BY "followships"."id" ASC LIMIT ?  [["user_id", 1], ["following_id", 3], ["LIMIT", 1]]
DELETE FROM "followships" WHERE "followships"."id" = ?  [["id", 4]]
---
  def destroy
    @followship = current_user.followships.where(following_id: params[:id]).first
    @followship.destroy