app/controllers/friendships_controller.rb

  def create
    @friendship = current_user.friendships.build(friend_id: params[:friend_id])
      if @friendship.save
---
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["friend_id", 2], ["created_at", "2018-01-05 14:06:18.884330"], ["updated_at", "2018-01-05 14:06:18.884330"]]

  def destroy
    @friendship = current_user.friendships.where(friend_id: params[:id]).first
    @friendship.destroy
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = ? ORDER BY "friendships"."id" ASC LIMIT ?  [["user_id", 1], ["friend_id", 2], ["LIMIT", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 1]]