app/controllers/restaurants_controller.rb

  def index
    @restaurants = Restaurant.page(params[:page]).per(9)
    @categories = Category.all
---
SELECT  "restaurants".* FROM "restaurants" LIMIT ? OFFSET ?  [["LIMIT", 9], ["OFFSET", 0]]
SELECT COUNT(*) FROM "restaurants"
SELECT "categories".* FROM "categories"

  def feeds
    @recent_restaurants = Restaurant.order(created_at: :desc).limit(10)
    @recent_comments = Comment.order(created_at: :desc).limit(10)
---
SELECT  "restaurants".* FROM "restaurants" ORDER BY "restaurants"."created_at" DESC LIMIT ?  [["LIMIT", 10]]
SELECT  "comments".* FROM "comments" ORDER BY "comments"."created_at" DESC LIMIT ?  [["LIMIT", 10]]

  def dashboard
    @restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]

  def favorite
    @restaurant = Restaurant.find(params[:id])
    @restaurant.favorites.create!(user: current_user)
    @restaurant.count_favorites
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["restaurant_id", 1], ["created_at", "2017-12-30 13:48:01.145353"], ["updated_at", "2017-12-30 13:48:01.145353"]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."restaurant_id" = ?  [["restaurant_id", 1]]

  def unfavorite
    @restaurant = Restaurant.find(params[:id])
    favorites = Favorite.where(restaurant: @restaurant, user: current_user)
    favorites.destroy_all
    @restaurant.count_favorites
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."restaurant_id" = 1 AND "favorites"."user_id" = 1
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."restaurant_id" = ?  [["restaurant_id", 1]]

  def like
    @restaurant = Restaurant.find(params[:id])
    @restaurant.likes.create!(user: current_user)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["restaurant_id", 1], ["created_at", "2017-12-30 15:20:53.259567"], ["updated_at", "2017-12-30 15:20:53.259567"]]

  def unlike
    @restaurant = Restaurant.find(params[:id])
    likes = Like.where(restaurant: @restaurant, user: current_user)
    likes.destroy_all
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."restaurant_id" = 1 AND "likes"."user_id" = 1
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]

  def ranking
    @restaurants = Restaurant.order(favorites_count: :desc).limit(10)
---
SELECT  "restaurants".* FROM "restaurants" ORDER BY "restaurants"."favorites_count" DESC LIMIT ?  [["LIMIT", 10]]